<a href="https://colab.research.google.com/github/camilaccosta/Exerc-cios-m-dulo-1-/blob/main/LISTA_PANDAS_2_Q_Avocado_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

**QUESTÃO 01** 

O arquivo avocado.csv consiste em um dataset que contém dados sobre vendas de abacates (avocado, em inglês) em diversas regiões dos Estados Unidos. Essa dataset contém as seguintes colunas:

**Date -** a data da observação 

**AveragePrice -** o preço médio de um único abacate

**year -** o ano

**region -** a cidade ou região da observação

Total Volume - volume total de abacates vendidos

Além das informações acima, contidas no arquivo avocado.csv, o tipo do abacate (convencional ou orgânico) também seria uma informação importante para a sua análise. Suponhamos que você conseguiu essas informações para cada uma das observações do arquivo avocado.csv, na mesma ordem, e salvou-as no arquivo avocado_type.csv. Portanto, tudo o que você precisa é juntar esses dois arquivos em um mesmo DataFrame. E, em seguida, salve-o em um arquivo csv.

PS. Caso queira criar uma Series com os dados aleatórios para o tipo de abacate, utilize o código abaixo:

tipos = pd.Series(np.random.randint(0, 2, df_avocado.shape[0]))
tipos = tipos.map({0: 'convencional', 1:'orgânico'})

In [ ]:
#Ler o arquivo 
avocado=pd.read_csv("avocado.csv") 
avocado_type = pd.read_csv("avocado_type.csv")

In [ ]:
avocado.head() # .head: Mostra as 5 primeiras linhas do arquivo

         Date  AveragePrice  Total Volume  year  region
0  2015-12-27          1.33      64236.62  2015  Albany
1  2015-12-20          1.35      54876.98  2015  Albany
2  2015-12-13          0.93     118220.22  2015  Albany
3  2015-12-06          1.08      78992.15  2015  Albany
4  2015-11-29          1.28      51039.60  2015  Albany

In [ ]:
avocado_type.head()

           type
0  conventional
1  conventional
2  conventional
3  conventional
4  conventional

**(A)** tudo o que você precisa é juntar esses dois arquivos em um mesmo DataFrame. E, em seguida, salve-o em um arquivo csv.

In [ ]:
# .merge(): Realizar a união das duas planilhas. Esse método é bem flexível e pode ser escolhida qualquer coluna como ponto de união.Nesse caso
# usamos o próprio index. Obs: Poderia ter utilizado o método Join (.join), que não é flexível e somente é possível a utilização da coluna index 
# como ponto de união. 


avocado_completo= avocado.merge(avocado_type, how='inner', left_index=True, right_index=True)

In [ ]:
avocado_completo.head()

         Date  AveragePrice  Total Volume  year  region          type
0  2015-12-27          1.33      64236.62  2015  Albany  conventional
1  2015-12-20          1.35      54876.98  2015  Albany  conventional
2  2015-12-13          0.93     118220.22  2015  Albany  conventional
3  2015-12-06          1.08      78992.15  2015  Albany  conventional
4  2015-11-29          1.28      51039.60  2015  Albany  conventional

**(B)** Salvar em um arquivo csv

In [ ]:
avocado_completo.to_csv("L2_Pandas_Questao1_Avocado.csv", sep="\t")

**QUESTÃO 2**

Carregue o arquivo csv que você salvou na questão anterior e, em seguida, obtenha o que é solicitado nos itens elencados abaixo:


(a) A quantidade de abacates do tipo convecional e do tipo orgânico.

(b) A quantidade de registros (linhas) de abacates vendidos para cada região.

(c) Para que todos os labels das colunas fiquem padronizados, renomeie aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula.

(d) Uma vez que você já possui uma coluna com a data, remova a coluna que apresenta o ano.

In [45]:
avocado_completo = pd.read_csv("L2_Pandas_Questao1_Avocado.csv", sep="\t") #Leitura do arquivo csv.

**(a)** A quantidade de abacates do tipo convecional e do tipo orgânico.

In [74]:
colunas_selecionadas =["Total Volume", "type"]
avocados_selecao_tipos = avocado_completo.filter(items = colunas_selecionadas)
avocados_selecao_tipos.groupby(["type"]).size()

type
conventional    9126
organic         9123
dtype: int64

**(b)** A quantidade de registros (linhas) de abacates vendidos para cada região.

In [66]:
avocado_completo.groupby(["Region"]).size()

Region
Albany                 338
Atlanta                338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
Midsouth               338
Nashville              338
NewOrleansMobile       338
NewYork                338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
Sacramento             338
SanDiego               338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
WestTexNewMexico       335
dtype: int64

In [67]:
avocado_completo

       Unnamed: 0        Date  ...            Region          Type
0               0  2015-12-27  ...            Albany  conventional
1               1  2015-12-20  ...            Albany  conventional
2               2  2015-12-13  ...            Albany  conventional
3               3  2015-12-06  ...            Albany  conventional
4               4  2015-11-29  ...            Albany  conventional
...           ...         ...  ...               ...           ...
18244       18244  2018-02-04  ...  WestTexNewMexico       organic
18245       18245  2018-01-28  ...  WestTexNewMexico       organic
18246       18246  2018-01-21  ...  WestTexNewMexico       organic
18247       18247  2018-01-14  ...  WestTexNewMexico       organic
18248       18248  2018-01-07  ...  WestTexNewMexico       organic

[18249 rows x 6 columns]

**(c)** Para que todos os labels das colunas fiquem padronizados, renomeie aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula.

In [47]:
#Método rename : deve ter como parâmetro o que será renomeado (nosso caso, colunas), "nome atual" : "nome futuro".

avocado_completo.rename(columns={"year": "Year", "region": "Region", "type":"Type"}, inplace= True)

**(d) Uma vez que você já possui uma coluna com a data, remova a coluna que apresenta o ano.**

In [48]:
#Método drop serve para apagar algo, e deve conter no parâmetro o que será apagado, o axis=1 (quantidade de eixo.No caso =1 pq é o vertical - Coluna)
#Por padrão o  inplace = False, quando for assim, não precisa explicitar. Caso queira salvar essa alteração no arquivo original, o inplace = True.

avocado_completo.drop(["Year"], axis=1, inplace=True)

**QUESTÃO 3**
Carregue, em um objeto DataFrame, o mesmo dataset que você salvou na questão Q1, agrupe os dados do DF pelo tipo do abacate e, em seguida, obtenha:

(a) A volume total de abacates vendidos para cada tipo.

(b) O preço médio dos abacates vendidos para cada tipo.

In [69]:
#Leitura do arquivo csv.
avocado_completo = pd.read_csv("L2_Pandas_Questao1_Avocado.csv", sep="\t")

**(a) A volume total de abacates vendidos para cada tipo.**

In [72]:
#Variável que recebe apenas as Volume Total e tipo.
avocado_volume_tipo =["Total Volume", "type"] 

# Filtra as colunas armazenadas na variável avocado_preco_tipo
avocados_por_tipo = avocado_completo.filter(items = avocado_volume_tipo)  

# agrupa por tipo (coluna type) e calcula a soma, por tipo, usando a coluna Total Volume.
avocados_por_tipo.groupby(["type"]).sum()

              Total Volume
type
conventional  1.508722e+10
organic       4.361817e+08

**(b) O preço médio dos abacates vendidos para cada tipo.**

In [78]:
#Variável que recebe apenas as colunas de preço e tipo. 
avocado_preco_tipo =["AveragePrice", "type"] 

# Filtra as colunas armazenadas na variável avocado_preco_tipo e armazena esse filtro em outra variável,avocados_preco_medio.
avocados_preco_medio = avocado_completo.filter(items = avocado_preco_tipo) 

# agrupa por tipo (coluna type) e calcula a média, por tipo, usando a coluna AveragePrice.
avocados_preco_medio.groupby("type").mean()

              AveragePrice
type
conventional      1.158040
organic           1.653999